OpenFOAM_Artery_Lab_ADT/openfoam9/tutorials/combustion/PDRFoam/flamePropagationWithObstacles/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-05;
        relTol          0.01;
    };

    rhoFinal
    {
        $rho;
        tolerance       1e-06;
        relTol          0;
    };

    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
        relTol          0.01;
    };

    pFinal
    {
        $p;
        tolerance       1e-6;
        relTol          0;
    };

    "(b|Xi|ft|ha|hau|k|epsilon)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0.1;
    }

    "(b|Xi|ft|ha|hau|k|epsilon)Final"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0;
    }
}

PIMPLE
{
    nCorrectors     2;
    nOuterCorrectors  1;
    nNonOrthogonalCorrectors 0;
    momentumPredictor yes;
}


// ************************************************************************* //
